<template>
  <el-card class="illustrate">
    <div class="content">
      {{ text }}
    </div>
  </el-card>
</template>

<script lang="ts" setup>
const text = `
    龙，是祖国的象征，我们每个炎黄子孙都是龙的传人。有福同享，有难同当——这就是华夏儿女泱泱的气节，因为我们有一个共同的母亲，那就是中国！
一想到祖国这个字眼，我就会感到无比的激动，那壮丽的山河，悠久的历史，灿烂的文化，优良的传统……无不是我们中国人的骄傲。祖国，你缔造了一个又一个的美丽神话：四大发明令人惊叹，万里长城举世瞩目，神舟六号遨游太空，北京奥运成功举办，抗震救灾众志成城……这些怎能不让我们中华儿女倍感自豪？回首往昔，在我们遭受外国人的欺凌时，你一次又一次地从危险困境中走出来，因为你心中有我们，有人民！你用伟岸身躯来保护我们，我们也要回报于你：爱你，保卫你。
从我懂得要爱国的那一天起，“李大钊”这个名字就深深地印在我的脑海中：1926年3月，李大钊为了拯国家于危难，救人民于水火，领导并亲自参加了北京人民反对日、英帝国主义和反对军阀张作霖、吴佩孚的斗争。北洋军阀段祺瑞执政府制造了“三?一八”惨案，北京一片白色恐怖。李大钊在极端危险和困难的情况下，继续领导党的北方组织坚持革命斗争。1927年4月6日，奉系军阀张作霖勾结帝国主义，逮捕了李大钊等80余人。李大钊备受酷刑，在监狱中，在法庭上，始终大义凛然，坚贞不屈。4月28日，反动军阀不顾广大人民群众和社会舆论的强烈反对和谴责，悍然将李大钊等20位革命者绞杀在西交民巷京师看守所内。李大钊第一个走上绞架，从容就义，时年38岁。五千多年的文明史，孕育了华夏儿女的钢筋铁骨养成了中华民族的“浩然正气”。像李大钊这样“捐躯赴国难，视死忽如归”的英雄在我们祖国有何止他一个：精忠报国的岳飞、收复台湾的郑成功、两弹一星的邓稼先、中国革命的先驱者孙中山……无数仁人志士用碧血丹心谱写了一曲曲爱国之歌。他们就算死也要为祖国效忠。
同学们，我们应该为生在这个英雄的国度而自豪，为这些民族之花而骄傲！我们少先队员也要向这些爱国者学习，就算不能为祖国死，也要为祖国尽自己最大的力。爱国，不应该流于形式，它需要的是实实在在的行动。我们要从自我做起，从身边的小事做起：不乱丢垃圾，不随地吐痰，不踩踏花草；节约每一滴水，节约每一张纸，节约每一度电……我们从小就要树立远大的理想，那就是报效祖国，为祖国的繁荣富强而努力奋斗。想到祖国以前受到的种种屈辱，我就会在心中燃起一团团熊熊烈火。我在心底里不断地说：“加油，自己；加油，祖国！”我深知：报效祖国需要有强健的身体，丰富的学识，高超的本领。因此，我要珍惜现在的每分每秒，抓紧锻炼身体，努力学习功课，培养高尚的道德情操，掌握丰富的知识，增强创新意识，准备着，时刻准备着——为建设祖国，振兴中华做出自己应有的贡献。
祖国，你将永远会在我心中占有崇高神圣的地位，因为如果没有日益强大起来的你，就不会有我们大家现在的幸福生活，祖国，我永远祝福你！
1、绚丽多彩的服饰
　　①刚建国时期——新旧交替，革命特色
　　新中国刚成立时，人们的服装上还保留着民国时期的样式。城市市民一般穿侧面开襟扣扣的长袍，妇女穿旗袍。农村男子一般穿中式的对襟短衣、长裤，妇女穿左边开襟的短衫、长裤，有的还穿一条长裙。当时人们做衣的面料多是机织的“洋布”、粗棉布、麻布。此外还时行西装和中山装。晚年的孙中山经常穿的服装在长袍马褂与西装革履中间显得格外突出，人们把这种服装称作中山装，并把它的款式与孙中山的革命信仰和原则联系在一起，比如四个口袋象征国之四维，即礼、义、廉、耻；袖子上的三颗纽扣则代表民族、民权和民生三民主义，中山装成为国民革命的象征，实际上国民党早已叛变革命。
　　新中国成立后，穿衣打扮与革命紧紧的联系在一起。西装和旗袍被看作资产阶级情调，它们在人们的生活中逐渐消失了将近20年。中山装和列宁装成为人民的普遍选择。开国大典时，新中国的领导人第一次在天安门城楼上集体亮相，毛泽东和他身边的领导人穿中山装的形象更是引起世界瞩目。男性穿中山装，显得庄重、精神。中山装十分正统，上衣的纽扣很多，四个口袋也都平平整整，但样式过于呆板，缺乏创新。后来演变成经过一定改进的人民装。也就是从那时起，一种来自苏联的双排扣制服——“列宁装”，在参加工作的女性中流行起来。它因列宁在十月革命前后常穿而得名，样式为西装开领，双排扣，各有三个纽扣，腰中束一根布带。这款服装后来竟成了无数中国女性最崇尚、青睐的“时装”，其中，革命女干部几乎是人人必穿列宁装，以显示其革命。
　　②改革开放前——朴素单调
　　50年代的人们崇尚劳动最光荣，朴素是时尚。年轻姑娘们曾一度爱上了男式背带工装裤和格子衬衣。1956年，三大改造开始轰轰烈烈的进行，人们的生活一天天好起来的时候，流行的色彩也从蓝色、灰色变得丰富多彩了。从苏联传入的连衣裙“布拉吉”成为最受欢迎的服装。布拉吉裙在中国的流行，得归功于一位苏联的领导人。这位领导人来中国访问时，提出中国的服装不符合社会主义大国形象，“女性应该人人穿花衣，以体现社会主义欣欣向荣的面貌”。于是，色彩鲜艳的布拉吉裙成了各大中城市最亮丽的风景。
　　在讲求勤俭的年代，美丽的服装大多是家庭制作而来。巧手的姑娘和母亲们按照画报上的服装裁剪式样，自己动手，使军装变得合身，棉布衬衣变得漂亮。而此时的中山装成为中国最庄重也最为普通的服装，那时拥有一套毛料中山装是令人羡慕的事情，而在中山装的右上口袋插上一支甚至两支钢笔，则是有知识、有文化的表现。后来，有人根据中山装的特点，设计出了款式更简洁、明快的“人民装”、“青年装”和“学生装”。还有一种稍加改进的中山装，就是将领口开大，翻领也由小变大，很受人们的欢迎。当时，共和国的领袖毛泽东就特别喜欢穿这一款式的中山装。以后，国外有人便将这一款式的中山装称作“毛式中山装”。从那时开始，中山装的流行持续了近30年的时间。
　　60年代初期，是新中国历史上最艰苦的时期，由于三年自然灾害，1959年到1960年棉花大幅减产，棉布定量为每人21尺。人们买服装、棉布和日用纺织品都要凭布票，为了尽可能地节约，购买服装的标准是耐磨和耐赃，灰、黑、蓝色成为街头流行色，千篇一样、季节不分、男女不分的服装样式也更通行了。一位漫画家曾经形象地描绘出“人人一身蓝”的情景
　　“文化大革命”时，拥有一套军装是那个年代无数年轻人的理想。青少年喜欢穿一身草绿色的军装，头戴草绿色军帽，肩挎草绿色书包。这一身在当时来说可算是很奢侈、很有派头的了。当然，艰苦朴素还是那时最主流的时尚。为了表现自己的艰苦朴素，有人甚至将新买的衣服在水中做旧，或者在并未被损坏的衣服上打上几个补丁。这种今人看来相当可笑的行为，但在文革十年中盛行一时。当时的顺口溜是这样说的:新三年，旧三年，缝缝补补又三年……还有一首歌，也同样飘荡在建国初期的大街小巷:勤俭是咱的好传统呀，社会主义建设离不了，离不了……
　　但是，即使在色彩单一的年代，人们的爱美之心也依然会流露出来，一位摄影师把这种流露称之为“挡不住的春光”，这种自然而然传递出的美的追求，是一个时代留在人们脑海中深深的印记。
　　③改革开放以来——丰富多彩、时尚个性
　　改革开放以来，服装的花色、款式更加多样化，面料、质地也发生了很大的变化。
　　1980年是中国改革开放的第三个年头。随着时代的发展，人们的穿着越来越丰富，色彩也从单一的蓝色灰色变得五颜六色。当时上映的国产故事片《庐山恋》成为年轻人喜爱的影片。久违了的爱情故事，加上片中女主角新颖的时装，都令人产生耳目一新的感觉。她在影片中换了多少套衣服，成为当时年轻人讨论的热门话题。这一时期，戴太阳镜、留长头发、穿喇叭裤、蝙蝠衫成为时尚，很多人看不习惯，但年轻人却从中找到个性和自我的感觉。
　　1981年成立的中国大陆的第一支时装模特队成立，尽管当时只以“服装广告艺术表演班”的名义招生，但令举办者感到意外的是前来报名的人数是预计的四倍。三年后，这支表演队出访欧洲，引起了轰动。西方舆论惊呼：“毛泽东的孩子们穿起了时装！”来自中国的时装旋风，带给世界一个开放的新形象。
　　1984年，中国女排的姑娘们在美国洛杉机奥运会上实现“三连冠”的时候，北京流行起了运动装。色彩鲜艳的运动装成为爱美的人们首选服装。人们几乎随时随地地穿着运动服，甚至还成为了学生的校服和工人的厂服。
　　90年代，人们的生活向小康过渡，思想观念更为开放。人们的服饰在急速变化，穿衣打扮讲求个性和多变，很难用一种款式或色彩来概括时尚潮流，强调个性、不追逐流行本身也成为一种时尚。
　　从服装的变化上，我们看出了时代的进步和人们内心观念的转变。服饰的变化是以经济的发展为前提的，同时也反映了人们的思想观念随着时代的变化而变化，从以往的“从众”心理到“追求个性”。服饰的变化是人们生活质量提高的一个表现。
　　2、日益丰富的饮食
　　有一句话叫“民以食为天”，可以说人们将“食”作为生活的最低标准，同时人们也将“食”作为生活的最高追求和享受。从“食”的变化中，可以反映出一个社会的贫富盛衰，可以体味社会历史的变迁。
　　①刚建国时期——生活贫困，食不果腹或粗茶淡饭
　　②改革开放前——很有改善，但食物匮乏单调、票证盛行，人们营养不足，有些农村没有解决基本的温饱问题
　　粮票是计划经济的产物。50年代初，我国粮食短缺。中央政务院于1953年10月发布命令：全国实行粮食计划供应，采取凭证定量售粮办法，粮票出现了。北京从1960年8月起全市饮食业实行凭票用餐，食油、禽、蛋、肉、豆制品、蔬菜也实行限量供应。这一时期票据种类繁多，除了粮、油、布票，还增发了补助豆票、糕点票、高级脑力劳动者补助油票、节日补助油票，有些地方还发放过煤球票、冰棍票、烟酒糖票、豆腐票。在票证盛行的年代，也是物质短缺的时代，只有在逢年过节的时候，人们才能凭票购买一些糕点糖果、干货果品，而且分量都极少。
　　提问：书上112页人们为什么要使用票证？
　　生答：因为生产力水平不高，物质供应紧张，需要用票证限制人们的购买力。
　　三年自然灾害时期，粮食、蔬菜紧缺，在吃不饱的情况下，人们往往以胡萝卜充饥。由于缺乏最基本的营养，人们都有些浮肿。
　　③改革开放以来——不但吃饱，还可以吃好，营养均衡，粗细搭配，绿色食品深入人心
　　20世纪90年代以来，粮食供求走向市场，粮票消亡成为历史的必然。1993年5月，北京最后停止使用粮票，粮票全面退出历史舞台。一些象征短缺经济的布票、油票、肉票、豆腐票，也相继退出了人们的日常生活。如今这些时代象征已经成为收藏家手里的珍品。
　　今天，我们的物质生活已经极大地丰富了，菜场、超市、大卖场，琳琅满目的食品应有尽有。人们对于吃的要求也越来越高，不仅要“吃好”，还要吃得健康，科学卫生观念深入人心。人们讲究营养均衡，粗细搭配，口味清淡，要多吃蔬菜水果，少吃高脂肪高胆固醇的食物。以前因粮食不够用来充饥的野菜、粗粮，如今却成为餐桌上的健康食品。
　　“动脑筋”：以前因粮食不够用来充饥的野菜、粗粮，为什么如今成为餐桌上的美味呢？
　　生答：因为过去人们食物匮乏，只有野菜和粗粮，人们为解决温饱并无选择。现在食品供应丰富，人们不仅要吃饱，更要吃好。人们注意营养均衡，粗细搭配和选择绿色食品。
　　人们生活水平的提高反映了改革开放以来，社会生产力进一步发展和社会主义市场经济的繁荣。
　　3、面貌一新的居民住宅
　　①刚建国时期——居住条件极差
　　城市居民的住宅大多面积小，设施简陋。如北方的大杂院，南方的亭子间等，十分拥挤杂乱，屋子小得给人以压迫感。农村里，北方内地多为土坯房、窑洞，南方多住茅草房，房屋破旧，年久失修，岌岌可危。人畜有时混居一室，卫生条件差。
　　②改革开放前——不断改善，但居住条件仍较差
　　样式统一单调的平板房取代了建国初的破旧民居。一片片鱼鳞状的瓦片取代了破旧的屋顶，墙也不再是石砖砌成的，而是用石灰砌成的平坦而洁白的墙面。但房屋内部很少有装修，只有床、桌子、椅子等基本家具，看上去简朴整洁，洋溢着和谐宁静。
　　③改革开放以来——居住面积扩大，居住条件有了明显改善
　　老式的普通民居已经不能满足人民居住的需要，于是新型的住宅小区拔地而起，楼房鳞次栉比，犹如一座新城。
　　北京从1998年开始兴建经济适用房，为危改居民和北京城市中低收入家庭提供了“买得到、住得起”的选择。通过经济适用房，人们理解了什么叫“破旧立新”。一大批居民走出没有厨房、厕所，没有上下水道的老房子，搬进房屋质量有保障、小区环境优美、购物交通方便的新楼房。
　　今天，人们居住的选择更多了，有高层住宅区，有复式楼，有花园小区，甚至还有单门独院的特色别墅。当我们登上高楼远眺城市流光溢彩的景色时，也可以体会到古人“会当凌绝顶，一览众山小”的豪情。随着人们生活水平的提高，装修也成为热点，风格多样的装修丰富了我们的生活，也体现了人们生活品位的提高。
　　4、四通八达的交通
　　①刚建国时期——交通不便
　　大城市（如北京、上海），电车、汽车比较多见，黄包车，自行车是比较普遍的代步工具。在一般的中小城市，有少量的自行车和人力车。而农村里，北方有马车、人力板车，南方有航船、牛车，步行是最普遍的出行方式。
　　②改革开放前——有所改善，但以自行车为主
　　“一五”计划期间兴建宝成铁路、鹰厦铁路；新藏、青藏、川藏公路修到“世界屋脊”，密切了祖国内地同边疆的联系，也便利了经济文化的交流；1957年，武汉长江大桥建成，连接了长江南北的交通。国家整体交通水平有所提高。
　　改革开放前，城市的交通资源极为有限，人们出行除了用双脚行走之外，可以代步的交通工具也就是公交车和自行车了。但是公交线路少，车厢经常拥挤不堪。相比之下，最方便的交通工具当然是自行车，中国曾被称作“自行车王国”，可见人们对于自行车的依赖。但当时的道路建设也十分落后，这给人们的日常生活带来了很多不便。
　　③改革开放以来——交通条件明显改善，铁路、公路和航线增长很快
　　在80年代末的中国，出行对于许多人来说并不是一件愉快的事，买票难，乘车难，运输难。因铁路运输能力的不足，当时的铁路客运量每天超载50%，高峰时超出100%，每天有80万人站着乘火车，而全国每年积压的物资则高达1亿5000万吨，南北运输的缺口达6000万吨。
　　在民国时期，贯通南北的大动脉是京汉铁路，而时代的进步使得它已经满足不了人民的需求。1992年中央作出果断决定：京九铁路三年开通，并且京九铁路的概念已经更新，南端的终点由江西的九江延长到了香港九龙。1993年5月2日，建国以来兴建的规模最大、投资最多、一次建成里程最长的铁路干线开工了。1995年11月16日上午，京九铁路全线铺通。1996年9月1日，比原计划提前四个月，京九铁路实现全线开通运营。这条钢铁大动脉跨越九个省市，缓解了南北运输的矛盾，解决了铁路运输的瓶颈问题；它把即将回归祖国的香港和北京连接在一起，维护港澳地区的繁荣与稳定；它穿过多个革命老区，给老区人民带去了脱贫致富的希望。
　　高速公路是一个国家交通现代化的一个主要标志。高速公路的拥有量，也成为衡量经济发达程度的一项指标。1984年12月，沪嘉高速公路开始在上海兴建，并于1988年10月31日建成通车。这是我国第一条全线通车的高速公路，从此掀开了我国公路建设史上新的一页。除了跨省高速公路之外，全国许多省区都在地区内修建中短程高速公路，形成覆盖全国的高速公路网。同时应该指出学生，便利的交通也带来了城市发展中的环保问题，迫切需要解决环境污染和交通阻塞问题。要求感兴趣的同学可以撰写文章《我看城市交通》。提醒增强环保意识，认识建设和发展生态城市的重要性。
　　现在我们看到现代化大都市的道路可谓是生机勃勃，人群涌动，车流穿梭。这些交通工具也花样繁多，公交路线增多、设施改善（不仅有普通公交车，还有较为先进的豪华大巴、双层巴士，车内还安装了空调、移动电视）；出租车招手即是，私家车也屡见不鲜，地铁、轻轨等新型交通工具出现。人们在繁忙的工作中发现出行的来回行程已缩短，道路也变得越来越通畅了……人们的交通观念也大为转变，假日旅游增多，国内游、出国游开始由观光型走向休闲度假型，并且出境旅游变得越来越平民化，选择也越来越多，而且走马观花式的旅游已越来越不能满足游客的需求，个性化旅游悄然升温，人们放松心情度假，开始真正享受旅游带来的乐趣.
`;
</script>
<style scoped lang="scss">
.illustrate {
  margin-top: 20px;
  border-radius: 20px;
  min-height: 780px;
  margin-bottom: 50px;

  .content {
    // word-wrap: break-word;
    // word-break: break-all;
    white-space: break-spaces;
  }
}
</style>
